Repository: SlippinDylan/Techne
Catalog: App/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# %lld 个未提交的文件
source: %lld uncommitted files
zh_hans: %lld 个未提交的文件
zh_hant: %lld 個未提交的檔案

# Android 版本: %@ (SDK %@)
source: Android Version: %@ (SDK %@)
zh_hans: Android 版本: %@ (SDK %@)
zh_hant: Android 版本: %@ (SDK %@)

# Techne 将在重新启动后使用所选语言。
source: Techne will use the selected language after restarting.
zh_hans: Techne 将在重新启动后使用所选语言。
zh_hant: Techne 將在重新啟動後使用所選語言。

# deploy.device.unknown
source: Unknown device
zh_hans: 未知设备
zh_hant: 未知裝置

# deploy.not_installed
source: Not installed
zh_hans: 未安装
zh_hant: 未安裝

# deploy.status.cleaning
source: Force-removing the previous version...
zh_hans: 正在强力清除旧版本...
zh_hant: 正在強制移除舊版本...

# deploy.status.failure
source: Deployment failed: %@
zh_hans: 部署失败: %@
zh_hant: 部署失敗: %@

# deploy.status.installing
source: Performing deep installation (-r -d -t)...
zh_hans: 正在执行深度安装 (-r -d -t)...
zh_hant: 正在執行深度安裝 (-r -d -t)...

# deploy.status.launching
source: Force-launching the app...
zh_hans: 正在强制激活应用...
zh_hant: 正在強制啟動應用程式...

# deploy.status.parsing_apk
source: Parsing APK package name...
zh_hans: 正在解析 APK 包名...
zh_hant: 正在解析 APK 包名...

# deploy.status.ready
source: Ready
zh_hans: 就绪
zh_hant: 就绪

# deploy.status.success
source: Deployment succeeded (physical update verified)
zh_hans: 部署成功 (已校验物理更新)
zh_hant: 部署成功 (已校验實際更新)

# error.adb.build_tools_not_found
source: No usable aapt2/aapt was found, or the package name could not be read from the APK. Install Android SDK Build Tools.
zh_hans: 未找到可用的 aapt2/aapt，或无法从 APK 解析包名。请安装 Android SDK Build Tools。
zh_hant: 未找到可用的 aapt2/aapt，或無法從 APK 解析包名。請安裝 Android SDK Build Tools。

# error.adb.install_failed
source: ADB installation phase failed
zh_hans: ADB 安装阶段返回失败
zh_hant: ADB 安裝阶段返回失敗

# error.adb.install_not_applied
source: The installation may not have taken effect. Check the confirmation prompt on the device.
zh_hans: 安装未生效，请手动确认手机弹窗
zh_hant: 安裝未生效，請手動確認手机弹窗

# error.adb.monkey_failed
source: Monkey launch phase failed
zh_hans: Monkey 激活阶段返回失败
zh_hant: Monkey 啟動阶段返回失敗

# error.browser.debug_port_unavailable
source: No available browser debugging port was found.
zh_hans: 未找到可用的浏览器调试端口
zh_hant: 未找到可用的瀏覽器偵錯連接埠

# error.browser.invalid_url
source: Invalid browser address: %@
zh_hans: 无效的浏览器地址：%@
zh_hant: 無效的瀏覽器地址：%@

# error.browser.launch_in_progress
source: The browser is already launching.
zh_hans: 浏览器正在启动中，请勿重复点击
zh_hant: 瀏覽器正在啟動中，請勿重複按一下

# error.browser.missing_profile_directory
source: Browser instance directory is missing.
zh_hans: 缺少浏览器实例目录
zh_hant: 缺少瀏覽器實例目錄

# error.browser.tracking_directory_creation_failed
source: Failed to create the browser instance directory.
zh_hans: 浏览器实例目录创建失败
zh_hant: 瀏覽器實例目錄建立失敗

# error.command_configuration.name_exists
source: A configuration with this name already exists: %@
zh_hans: 配置名称已存在: %@
zh_hant: 設定名稱已存在: %@

# error.command_configuration.name_required
source: Configuration name cannot be empty.
zh_hans: 配置名称不能为空
zh_hant: 設定名稱不能為空白

# error.command_configuration.not_found
source: Configuration not found.
zh_hans: 配置不存在
zh_hant: 設定不存在

# error.command_configuration.start_command_required
source: Start command cannot be empty.
zh_hans: 启动命令不能为空
zh_hant: 啟動指令不能為空白

# error.command_configuration.unsafe_command
source: The command contains a dangerous operation: %@
zh_hans: 命令包含危险操作: %@
zh_hant: 指令包含危險操作: %@

# error.git.clean_cache_failed
source: Failed to clean the cache.
zh_hans: 清理缓存失败
zh_hant: 清理快取失敗

# error.git.command_not_allowed
source: Command is not allowed: %@
zh_hans: 不允许执行的命令: %@
zh_hant: 不允許執行的指令: %@

# error.git.uncommitted_files
source: The working directory has %lld uncommitted files. Commit or discard them first.
zh_hans: 工作区有 %lld 个未提交的文件，请先提交或放弃更改
zh_hant: 工作區有 %lld 個未提交的檔案，請先提交或捨棄變更

# error.process.failure
source: Process %d: %@
zh_hans: 进程 %d: %@
zh_hant: 程式 %d: %@

# error.process.group_failure
source: Process group %d: %@
zh_hans: 进程组 %d: %@
zh_hant: 程式組 %d: %@

# error.process.group_force_stop_failed
source: Force-stopping process group %d had no effect, possibly due to permissions.
zh_hans: 进程组 (%d) 强制停止无效，可能存在权限限制
zh_hant: 程式組 (%d) 強制停止無效，可能存在權限限制

# error.process.managed_process_already_running
source: A managed process is already running for this project.
zh_hans: 项目已有受管进程正在运行
zh_hant: 專案已有受管程式正在執行

# error.process.no_matching_project_process
source: No running process matching the project path was found.
zh_hans: 未找到匹配项目路径的运行进程
zh_hant: 未找到匹配專案路徑的執行程式

# error.process.stop_failed
source: Failed to stop process %d.
zh_hans: 进程 %d 停止失败
zh_hant: 程式 %d 停止失敗

# error.process.wait_result_missing
source: Process wait result was missing.
zh_hans: 进程等待结果缺失
zh_hant: 程式等待結果缺失

# error.project.already_exists
source: Project already exists: %@
zh_hans: 项目已存在: %@
zh_hant: 專案已存在: %@

# error.project.already_exists.recovery
source: Use a different project name or path.
zh_hans: 请使用不同的项目名称或路径
zh_hant: 請使用不同的專案名稱或路徑

# error.project.file_watching_requires_mini_program
source: Only WeChat Mini Program projects support rebuilding file watching.
zh_hans: 只有微信小程序项目支持重建文件监听
zh_hant: 只有微信小程式專案支援重建檔案監看

# error.project.git_operation_failed
source: Git operation failed (%@): %@
zh_hans: Git 操作失败 (%@): %@
zh_hant: Git 操作失敗 (%@): %@

# error.project.git_operation_failed.recovery
source: Make sure the project is a valid Git repository with no uncommitted changes.
zh_hans: 请确保项目是有效的 Git 仓库，并且没有未提交的更改
zh_hant: 請確認專案是有效的 Git 儲存庫，並且沒有未提交的變更

# error.project.invalid_configuration
source: Invalid configuration: %@
zh_hans: 配置无效: %@
zh_hant: 設定無效: %@

# error.project.invalid_configuration.recovery
source: Check that the configuration file format is valid.
zh_hans: 请检查配置文件格式是否正确
zh_hant: 請檢查設定檔案格式是否正確

# error.project.invalid_startup_mode
source: Invalid startup mode.
zh_hans: 无效的启动模式
zh_hant: 無效的啟動模式

# error.project.path_not_found
source: Path does not exist: %@
zh_hans: 路径不存在: %@
zh_hant: 路徑不存在: %@

# error.project.path_not_found.recovery
source: Check that the path is correct and the directory exists.
zh_hans: 请检查路径是否正确，确保目录存在
zh_hant: 請檢查路徑是否正確，確認目錄存在

# error.project.persistence_failed
source: Persistence failed: %@
zh_hans: 持久化失败: %@
zh_hant: 持久化失敗: %@

# error.project.persistence_failed.recovery
source: Check available disk space and file permissions.
zh_hans: 请检查磁盘空间和文件权限
zh_hant: 請檢查磁碟空間與檔案權限

# error.project.process_start_failed
source: Failed to start process: %@
zh_hans: 进程启动失败: %@
zh_hant: 程式啟動失敗: %@

# error.project.process_start_failed.recovery
source: Check that the start command is correct and dependencies are installed.
zh_hans: 请检查启动命令是否正确，确保依赖已安装
zh_hant: 請檢查啟動指令是否正確，確認相依套件已安裝

# error.project.process_stop_failed
source: Failed to stop process: %@
zh_hans: 进程停止失败: %@
zh_hant: 程式停止失敗: %@

# error.project.process_stop_failed.recovery
source: Try terminating the process manually or restarting the app.
zh_hans: 请尝试手动终止进程或重启应用
zh_hant: 請嘗試手動終止程式或重新啟動應用程式

# error.project.selected_command_configuration_not_found
source: The selected command configuration was not found.
zh_hans: 所选命令配置不存在
zh_hant: 所選指令設定不存在

# error.project.temporary_directory
source: Projects in temporary directories are not persisted. Choose a real project directory.
zh_hans: 临时目录项目不会被持久化，请选择真实项目目录
zh_hant: 暫存目錄專案不會被持久化，請選擇實際專案目錄

# error.project_analysis.invalid_package_manifest
source: The package.json format is invalid, so project commands could not be read.
zh_hans: package.json 格式无效，无法读取项目命令
zh_hant: package.json 格式無效，無法讀取專案指令

# error.project_analysis.missing_development_script
source: package.json does not declare a runnable dev, dev:*, start, or serve script.
zh_hans: package.json 未声明可运行的 dev、dev:*、start 或 serve 脚本
zh_hant: package.json 未宣告可執行的 dev、dev:*、start 或 serve 指令碼

# error.project_analysis.missing_mini_program_script
source: package.json does not declare a runnable WeChat Mini Program development script.
zh_hans: package.json 未声明可运行的微信小程序开发脚本
zh_hant: package.json 未宣告可執行的微信小程式開發指令碼

# error.project_analysis.missing_package_manifest
source: package.json was not found, so installation and start commands could not be determined.
zh_hans: 未找到 package.json，无法确认项目的安装和启动方式
zh_hant: 未找到 package.json，無法確認專案的安裝與啟動方式

# error.unknown
source: Unknown error.
zh_hans: 未知错误
zh_hant: 未知錯誤

# error.wechat.cli_not_found
source: WeChat DevTools CLI was not found. Make sure WeChat DevTools is installed.
zh_hans: 未找到微信开发者工具 CLI，请确认已安装微信开发者工具
zh_hant: 未找到微信開發者工具 CLI，請確認已安裝微信開發者工具

# error.wechat.command_failed
source: The WeChat DevTools command failed.
zh_hans: 微信开发者工具命令执行失败
zh_hant: 微信開發者工具指令執行失敗

# error.wechat.project_configuration_not_found
source: No project.config.json was found for WeChat DevTools to open.
zh_hans: 未找到可供微信开发者工具打开的 project.config.json
zh_hant: 未找到可供微信開發者工具開啟的 project.config.json

# log.adb.deployment_failed
source: Android APK deployment failed: %@
zh_hans: 安卓 APK 部署失败：%@
zh_hant: Android APK 部署失敗：%@

# log.adb.deployment_started
source: Starting Android APK deployment: %@
zh_hans: 开始部署安卓 APK：%@
zh_hant: 開始部署Android APK：%@

# log.adb.deployment_succeeded
source: Android APK deployed successfully: %@
zh_hans: 安卓 APK 部署成功：%@
zh_hant: Android APK 部署成功：%@

# log.browser.close_error
source: Error closing browser instance: %@
zh_hans: 关闭浏览器实例异常: %@
zh_hant: 關閉瀏覽器實例異常: %@

# log.browser.close_failed
source: Failed to close browser instance: %@
zh_hans: 关闭浏览器实例失败: %@
zh_hant: 關閉瀏覽器實例失敗: %@

# log.browser.closed
source: Browser instance closed: %@
zh_hans: 成功关闭浏览器实例: %@
zh_hant: 成功關閉瀏覽器實例: %@

# log.browser.closing
source: Closing browser instance: %@ (PID: %d)
zh_hans: 关闭浏览器实例: %@ (PID: %d)
zh_hant: 關閉瀏覽器實例: %@ (PID: %d)

# log.browser.closing_all
source: Closing all browser instances (%lld total)
zh_hans: 关闭所有浏览器实例 (共 %lld 个)
zh_hant: 關閉所有瀏覽器實例 (共 %lld 個)

# log.browser.scan_completed
source: Scan complete. Found %lld browser instances.
zh_hans: 扫描完成，找到 %lld 个浏览器实例
zh_hant: 掃描完成，找到 %lld 個瀏覽器實例

# log.browser.scan_failed
source: Failed to scan browser instances: %@
zh_hans: 扫描浏览器实例失败: %@
zh_hant: 掃描瀏覽器實例失敗: %@

# log.browser.scan_started
source: Scanning browser instances
zh_hans: 开始扫描浏览器实例
zh_hant: 開始掃描瀏覽器實例

# log.category.browser
source: Browser
zh_hans: 浏览器
zh_hant: 瀏覽器

# log.category.browser_detection
source: Browser Detection
zh_hans: 浏览器检测
zh_hant: 瀏覽器偵測

# log.category.development_project
source: Development Project
zh_hans: 开发项目
zh_hant: 開發專案

# log.category.mini_program
source: Mini Program
zh_hans: 小程序
zh_hant: 小程式

# log.category.server
source: Server
zh_hans: 服务器
zh_hant: 伺服器

# log.category.server_detection
source: Server Detection
zh_hans: 服务器检测
zh_hant: 伺服器偵測

# log.category.system
source: System
zh_hans: 系统
zh_hant: 系統

# log.dev_server.close_error
source: Error closing development server: %@
zh_hans: 关闭服务器异常: %@
zh_hant: 關閉伺服器異常: %@

# log.dev_server.close_failed
source: Failed to close development server: %@
zh_hans: 关闭服务器失败: %@
zh_hant: 關閉伺服器失敗: %@

# log.dev_server.closed
source: Development server closed: %@
zh_hans: 成功关闭服务器: %@
zh_hant: 成功關閉伺服器: %@

# log.dev_server.closing
source: Closing development server: %@ (PID: %d)
zh_hans: 关闭服务器: %@ (PID: %d)
zh_hant: 關閉伺服器: %@ (PID: %d)

# log.dev_server.closing_all
source: Closing all development servers (%lld total)
zh_hans: 关闭所有服务器 (共 %lld 个)
zh_hant: 關閉所有伺服器 (共 %lld 個)

# log.dev_server.found
source: - %@ (port: %lld)
zh_hans: - %@ (端口: %lld)
zh_hant: - %@ (連接埠: %lld)

# log.dev_server.none_found
source: No development servers found
zh_hans: 未找到开发服务器
zh_hant: 未找到開發伺服器

# log.dev_server.scan_completed
source: Scan complete. Found %lld development servers.
zh_hans: 扫描完成，找到 %lld 个开发服务器
zh_hant: 掃描完成，找到 %lld 個開發伺服器

# log.dev_server.scan_started
source: Scanning development servers
zh_hans: 开始扫描开发服务器
zh_hant: 開始掃描開發伺服器

# log.git.branch_switch_blocked
source: Branch switch blocked: %@ - %@
zh_hans: 切换分支熔断：%@ - %@
zh_hant: 切換分支熔断：%@ - %@

# log.git.branch_switch_completed
source: Branch switch complete: %@ -> %@
zh_hans: 分支切换流水线完成：%@ -> %@
zh_hant: 分支切換流水線完成：%@ -> %@

# log.git.discard_changes_failed
source: Failed to discard changes: %@ - %@
zh_hans: 放弃更改失败：%@ - %@
zh_hant: 捨棄變更失敗：%@ - %@

# log.git.discarded_changes
source: Changes discarded: %@
zh_hans: 成功放弃更改：%@
zh_hant: 成功捨棄變更：%@

# log.git.discarding_changes
source: Discarding changes: %@
zh_hans: 放弃更改：%@
zh_hant: 捨棄變更：%@

# log.git.post_cleanup_failed
source: Post-switch cleanup failed: %@ - %@
zh_hans: 后置清理失败：%@ - %@
zh_hant: 後置清理失敗：%@ - %@

# log.git.pre_cleanup_failed
source: Pre-switch cleanup failed: %@ - %@
zh_hans: 前置清理失败：%@ - %@
zh_hant: 前置清理失敗：%@ - %@

# log.git.switch_failed
source: Git branch switch failed: %@ - %@
zh_hans: Git 切换失败：%@ - %@
zh_hant: Git 切換失敗：%@ - %@

# log.git.switching_branch
source: Switching branch: %@ -> %@
zh_hans: 开始异步切换分支：%@ -> %@
zh_hant: 開始非同步切換分支：%@ -> %@

# log.launch_settings.failed
source: Failed to configure the login item: %@
zh_hans: 设置登录项失败：%@
zh_hant: 設定登入項目失敗：%@

# log.process.execution_failed
source: Execution failed: %@
zh_hans: 执行异常：%@
zh_hant: 執行異常：%@

# log.process.preparing_start
source: Preparing to start development server: %@
zh_hans: 准备启动开发服务器：%@
zh_hant: 準備啟動開發伺服器：%@

# log.process.stop_warning
source: Problem stopping process: %@
zh_hans: 停止进程时出现问题: %@
zh_hant: 停止程式時出現問題: %@

# log.process.stopped
source: Development server stopped: %@
zh_hans: 成功停止开发服务器：%@
zh_hant: 成功停止開發伺服器：%@

# log.process.stopping
source: Stopping development server: %@
zh_hans: 停止开发服务器：%@
zh_hant: 停止開發伺服器：%@

# log_level.error
source: Error
zh_hans: 错误
zh_hant: 錯誤

# log_level.info
source: Info
zh_hans: 信息
zh_hant: 資訊

# log_level.success
source: Success
zh_hans: 成功
zh_hant: 成功

# log_level.warning
source: Warning
zh_hans: 警告
zh_hant: 警告

# operation.git.clean_cache
source: Clean Cache
zh_hans: 清理缓存
zh_hant: 清理快取

# operation.git.clean_untracked_files
source: Clean Untracked Files
zh_hans: 清理未跟踪文件
zh_hant: 清理未追蹤檔案

# operation.git.restore_changes
source: Restore File Changes
zh_hans: 恢复文件更改
zh_hant: 還原檔案變更

# operation.git.switch_branch
source: Switch Branch
zh_hans: 切换分支
zh_hant: 切換分支

# operation.git.switch_to_branch
source: Switch to branch %@
zh_hans: 切换分支到 %@
zh_hant: 切換分支到 %@

# project_type.development_services
source: Development Services & Instances
zh_hans: 开发服务与实例
zh_hant: 開發服務與實例

# project_type.mini_program_build
source: WeChat Mini Program Build
zh_hans: 微信小程序构建
zh_hant: 微信小程式建置

# startup_mode.default
source: Default
zh_hans: 默认
zh_hant: 預設

# terminal.adb.current_update_time
source: Current last update time: %@
zh_hans: 当前最后更新时间: %@
zh_hant: 目前最後更新時間: %@

# terminal.adb.deployment_started
source: [System] Starting force deployment mode (aligned with adb_deploy.sh)...
zh_hans: [系统] 启动暴力部署模式 (对齐 adb_deploy.sh)...
zh_hant: [系統] 啟動暴力部署模式 (对齐 adb_deploy.sh)...

# terminal.adb.fatal_error
source: [Critical Error] %@
zh_hans: [严重错误] %@
zh_hant: [严重錯誤] %@

# terminal.adb.install_verified
source: Verification passed: update time changed to %@
zh_hans: 物理校验通过：更新时间已变更为 %@
zh_hant: 實際校验通過：更新時間已變更為 %@

# terminal.adb.installing
source: [4/5] Performing deep installation (-r -d -t)...
zh_hans: [4/5] 正在执行深度安装 (-r -d -t)...
zh_hant: [4/5] 正在執行深度安裝 (-r -d -t)...

# terminal.adb.launching
source: [5/5] Force-launching the app with Monkey...
zh_hans: [5/5] 正在通过 Monkey 强制激活应用...
zh_hant: [5/5] 正在通過 Monkey 強制啟動應用程式...

# terminal.adb.package_name_found
source: Valid package name: %@
zh_hans: 识别到有效包名: %@
zh_hant: 识别到有效包名: %@

# terminal.adb.parsing_package_name
source: [1/5] Parsing APK package name...
zh_hans: [1/5] 正在解析 APK 内部包名...
zh_hant: [1/5] 正在解析 APK 内部包名...

# terminal.adb.reading_package_state
source: [2/5] Reading current app state...
zh_hans: [2/5] 正在读取当前应用物理状态...
zh_hant: [2/5] 正在讀取目前應用程式實際状態...

# terminal.adb.timestamp_unchanged
source: [Critical Warning] The physical timestamp did not change. The installation may not have taken effect.
zh_hans: [严重警告] 检测到物理时间戳未改变！安装可能未生效。
zh_hant: [严重警告] 偵測到實際時間戳未改變！安裝可能未生效。

# terminal.adb.uninstalling
source: [3/5] Force-removing the previous version and cached data...
zh_hans: [3/5] 正在执行强力物理卸载 (清除残留缓存)...
zh_hant: [3/5] 正在強制移除舊版本（清除殘留快取）...

# terminal.process.exited
source: [System] Process exited (code: %d)
zh_hans: [系统] 进程已结束 (退出码: %d)
zh_hant: [系統] 程式已結束 (結束代碼: %d)

# terminal.process.requesting_stop
source: [System] Requesting process group stop...
zh_hans: [系统] 正在请求停止进程组...
zh_hant: [系統] 正在要求停止程式組...

# terminal.process.start_failed
source: [Error] Failed to start process: %@
zh_hans: [错误] 进程启动失败: %@
zh_hant: [錯誤] 程式啟動失敗: %@

# terminal.process.starting_group
source: [System] Starting process group... Command: %@
zh_hans: [系统] 正在启动进程组... 命令: %@
zh_hant: [系統] 正在啟動程式組... 指令: %@

# terminal.project.development_service_stop_failed
source: Failed to stop development service: %@
zh_hans: 开发服务停止失败: %@
zh_hant: 開發服務停止失敗: %@

# terminal.project.development_service_stopped
source: Development service stopped
zh_hans: 开发服务已停止
zh_hant: 開發服務已停止

# terminal.project.restarting
source: Restarting...
zh_hans: 正在重新启动...
zh_hant: 正在重新啟動...

# terminal.project.startup_mode_changed
source: Launch mode changed to %@
zh_hans: 已切换启动模式为 %@
zh_hant: 已切換啟動模式為 %@

# terminal.project.startup_mode_changed_stop_failed
source: Launch mode was saved, but the previous process could not be stopped
zh_hans: 启动模式切换已保存，但停止旧进程失败
zh_hant: 啟動模式切換已儲存，但停止舊程式失敗

# terminal.project.stopping_development_service
source: Stopping development service...
zh_hans: 正在停止开发服务...
zh_hant: 正在停止開發服務...

# terminal.startup.checking_dependencies
source: [System] Checking dependencies...
zh_hans: [系统] 正在检查依赖...
zh_hant: [系統] 正在檢查相依套件...

# terminal.startup.dependencies_installed
source: [System] Dependencies installed
zh_hans: [系统] 依赖安装完成
zh_hant: [系統] 相依套件安裝完成

# terminal.startup.install_required
source: [System] Installing dependencies as required by policy: %@
zh_hans: [系统] 根据安装策略，准备执行安装命令: %@
zh_hant: [系統] 根據安裝策略，準備執行安裝指令: %@

# terminal.startup.missing_dependencies
source: [System] Missing dependencies detected. Running: %@
zh_hans: [系统] 检测到缺少依赖，准备执行安装命令: %@
zh_hant: [系統] 偵測到缺少相依套件，準備執行安裝指令: %@

# terminal.startup.preparing_install
source: [System] Preparing installation command: %@
zh_hans: [系统] 准备执行安装命令: %@
zh_hant: [系統] 準備執行安裝指令: %@

# terminal.startup.preparing_start_prefix
source: [System] Preparing start command:
zh_hans: [系统] 准备启动命令:
zh_hant: [系統] 準備啟動指令:

# terminal.system_message
source: [System] %@
zh_hans: [系统] %@
zh_hant: [系統] %@

# terminal.wechat.close_project_failed
source: Failed to close WeChat DevTools project: %@
zh_hans: 关闭微信开发者工具失败: %@
zh_hant: 關閉微信開發者工具失敗: %@

# terminal.wechat.closing_project
source: Closing the project window in WeChat DevTools...
zh_hans: 正在关闭微信开发者工具项目窗口...
zh_hant: 正在關閉微信開發者工具專案窗口...

# terminal.wechat.file_watching_rebuild_failed
source: Failed to rebuild file watching: %@
zh_hans: 重建文件监听失败: %@
zh_hant: 重建檔案監看失敗: %@

# terminal.wechat.file_watching_rebuilt
source: WeChat DevTools file watching rebuilt
zh_hans: 微信开发者工具文件监听已重建
zh_hant: 微信開發者工具檔案監看已重建

# terminal.wechat.open_project_failed
source: Failed to open WeChat DevTools: %@
zh_hans: 打开微信开发者工具失败: %@
zh_hant: 開啟微信開發者工具失敗: %@

# terminal.wechat.opening_native_mini_program
source: Opening native Mini Program in WeChat DevTools...
zh_hans: 正在通过微信开发者工具打开原生小程序...
zh_hant: 正在通過微信開發者工具開啟原生小程式...

# terminal.wechat.project_closed
source: WeChat DevTools project window closed
zh_hans: 微信开发者工具项目窗口已关闭
zh_hant: 微信開發者工具專案窗口已關閉

# terminal.wechat.project_opened
source: Project opened in WeChat DevTools
zh_hans: 微信开发者工具已打开项目
zh_hant: 微信開發者工具已開啟專案

# terminal.wechat.rebuilding_file_watching
source: Requesting WeChat DevTools to rebuild file watching...
zh_hans: 正在请求微信开发者工具重建文件监听...
zh_hant: 正在要求微信開發者工具重建檔案監看...

# 不会再写入命令模板卡片；项目卡片里展示的就是项目自身命令。
source: No command template card will be created; the project card shows the project's own commands.
zh_hans: 不会再写入命令模板卡片；项目卡片里展示的就是项目自身命令。
zh_hant: 不會再寫入指令模板卡片；專案卡片裡展示的就是專案自身指令。

# 丢弃更改
source: Discard Changes
zh_hans: 丢弃更改
zh_hant: 捨棄變更

# 丢弃更改命令
source: Discard Changes Command
zh_hans: 丢弃更改命令
zh_hant: 捨棄變更指令

# 从不安装
source: Never Install
zh_hans: 从不安装
zh_hant: 從不安裝

# 使用微信开发者工具管理打开、关闭和文件监听，无需配置 Shell 命令。
source: Use WeChat DevTools to manage opening, closing, and file watching; no Shell command is required.
zh_hans: 使用微信开发者工具管理打开、关闭和文件监听，无需配置 Shell 命令。
zh_hant: 使用微信開發者工具管理開啟、關閉與檔案監看，無需設定 Shell 指令。

# 例如：Vite + pnpm
source: Example: Vite + pnpm
zh_hans: 例如：Vite + pnpm
zh_hant: 例如：Vite + pnpm

# 例如：git reset --hard && git clean -fd
source: Example: git reset --hard && git clean -fd
zh_hans: 例如：git reset --hard && git clean -fd
zh_hant: 例如：git reset --hard && git clean -fd

# 例如：pnpm build
source: Example: pnpm build
zh_hans: 例如：pnpm build
zh_hant: 例如：pnpm build

# 例如：pnpm dev
source: Example: pnpm dev
zh_hans: 例如：pnpm dev
zh_hant: 例如：pnpm dev

# 例如：pnpm install
source: Example: pnpm install
zh_hans: 例如：pnpm install
zh_hant: 例如：pnpm install

# 例如：rm -rf dist node_modules/.cache
source: Example: rm -rf dist node_modules/.cache
zh_hans: 例如：rm -rf dist node_modules/.cache
zh_hant: 例如：rm -rf dist node_modules/.cache

# 保存
source: Save
zh_hans: 保存
zh_hant: 儲存

# 信息
source: Info
zh_hans: 信息
zh_hant: 資訊

# 停止
source: Stop
zh_hans: 停止
zh_hant: 停止

# 停止中
source: Stopping
zh_hans: 停止中
zh_hant: 停止中

# 停止命令
source: Stop Command
zh_hans: 停止命令
zh_hant: 停止指令

# 停止服务器
source: Stop Server
zh_hans: 停止服务器
zh_hant: 停止伺服器

# 全部
source: All
zh_hans: 全部
zh_hant: 全部

# 全部关闭
source: Close All
zh_hans: 全部关闭
zh_hant: 全部關閉

# 全部级别
source: All Levels
zh_hans: 全部级别
zh_hant: 全部級别

# 关于
source: About
zh_hans: 关于
zh_hant: 關於

# 关于 Techne
source: About Techne
zh_hans: 关于 Techne
zh_hant: 關於 Techne

# 关闭实例
source: Close Instance
zh_hans: 关闭实例
zh_hant: 關閉實例

# 关闭服务器
source: Stop Server
zh_hans: 关闭服务器
zh_hant: 關閉伺服器

# 切换分支
source: Switch Branch
zh_hans: 切换分支
zh_hant: 切換分支

# 删除
source: Delete
zh_hans: 删除
zh_hant: 刪除

# 删除配置
source: Delete Configuration
zh_hans: 删除配置
zh_hant: 刪除設定

# 刷新
source: Refresh
zh_hans: 刷新
zh_hant: 刷新

# 刷新状态
source: Refresh Status
zh_hans: 刷新状态
zh_hant: 刷新状態

# 刷新状态 (Cmd+R)
source: Refresh Status (Cmd+R)
zh_hans: 刷新状态 (Cmd+R)
zh_hant: 刷新状態 (Cmd+R)

# 取消
source: Cancel
zh_hans: 取消
zh_hant: 取消

# 可选启动模式
source: Optional Launch Modes
zh_hans: 可选启动模式
zh_hant: 可選啟動模式

# 可选地址，例如 http://localhost:5173
source: Optional address, for example http://localhost:5173
zh_hans: 可选地址，例如 http://localhost:5173
zh_hant: 可選地址，例如 http://localhost:5173

# 可选填写地址；留空时仅启动独立浏览器实例。
source: Optionally enter an address; leave it blank to start a standalone browser instance.
zh_hans: 可选填写地址；留空时仅启动独立浏览器实例。
zh_hant: 可選填寫地址；留空時僅啟動獨立瀏覽器實例。

# 启动
source: Start
zh_hans: 启动
zh_hant: 啟動

# 启动中
source: Starting
zh_hans: 启动中
zh_hant: 啟動中

# 启动命令
source: Start Command
zh_hans: 启动命令
zh_hant: 啟動指令

# 启动服务器
source: Start Server
zh_hans: 启动服务器
zh_hant: 啟動伺服器

# 启动浏览器失败: %@
source: Failed to start the browser: %@
zh_hans: 启动浏览器失败: %@
zh_hant: 啟動瀏覽器失敗: %@

# 命令配置
source: Command Configuration
zh_hans: 命令配置
zh_hant: 指令設定

# 在浏览器中打开
source: Open in Browser
zh_hans: 在浏览器中打开
zh_hant: 在瀏覽器中開啟

# 在终端打开
source: Open in Terminal
zh_hans: 在终端打开
zh_hant: 在終端機開啟

# 在终端打开失败: %@
source: Failed to open in Terminal: %@
zh_hans: 在终端打开失败: %@
zh_hant: 在終端機開啟失敗: %@

# 备份导入失败
source: Backup Import Failed
zh_hans: 备份导入失败
zh_hant: 備份匯入失敗

# 备份导出失败
source: Backup Export Failed
zh_hans: 备份导出失败
zh_hant: 備份匯出失敗

# 复制所有
source: Copy All
zh_hans: 复制所有
zh_hant: 複製所有

# 复制日志
source: Copy Logs
zh_hans: 复制日志
zh_hant: 複製日誌

# 复制选中
source: Copy Selected
zh_hans: 复制选中
zh_hant: 複製選取

# 安卓应用部署
source: Android App Deployment
zh_hans: 安卓应用部署
zh_hant: Android應用程式部署

# 安装中
source: Installing
zh_hans: 安装中
zh_hant: 安裝中

# 安装依赖
source: Install Dependencies
zh_hans: 安装依赖
zh_hant: 安裝相依套件

# 安装依赖命令
source: Install Dependencies Command
zh_hans: 安装依赖命令
zh_hant: 安裝相依套件指令

# 安装操作
source: Installation
zh_hans: 安装操作
zh_hant: 安裝操作

# 安装策略
source: Installation Strategy
zh_hans: 安装策略
zh_hant: 安裝策略

# 导入备份
source: Import Backup
zh_hans: 导入备份
zh_hant: 匯入備份

# 导出备份
source: Export Backup
zh_hans: 导出备份
zh_hant: 匯出備份
